// 棋格数据
var b0 = {
    RES_NAME: "起點",
    owner: "none",
    state: 0,
};
// var b1 = {
//     name: "韓式火鍋",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_1.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b2 = {
//     name: "東亞沙叻",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_2.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b3 = {
//     name: "韓式燒肉",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_3.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b4 = {
//     name: "北日壽司",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_4.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b5 = {
//     name: "美一鍋",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_5.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b6 = {
//     name: "星巴克",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_6.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b7 = {
//     name: "美式餐廳",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_7.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b8 = {
//     name: "原籍焗烤",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_8.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b9 = {
//     name: "五一味鍋",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_9.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b10 = {
//     name: "三媽臭臭鍋",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_10.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b11 = {
//     name: "小品炸物",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_11.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b12 = {
//     name: "抹一味",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_12.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b13 = {
//     name: "原燒",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_13.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b14 = {
//     name: "乾杯",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_14.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b15 = {
//     name: "屋馬",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_15.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b16 = {
//     name: "MOMO",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_16.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b17 = {
//     name: "享鴨",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_17.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b18 = {
//     name: "爭鮮",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_18.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };
// var b19 = {
//     name: "食味",
//     state: 0,
//     owner: "none",
//     src_img: "./image/food_19.jpg",
//     text: "蘇維拉莊園餐廳與普拉伯義大利坊合作普拉伯義大利坊秉持美味、 品質、 專業、 服務的四大理念並以家人的思維出發， 細心觀察及對待每一位客人普拉伯熱情與溫馨瀰漫的氛圍裡要與你分享我們獨特的美味、 品質、 專業及服務使用新鮮簡單的食材， 道地義式原物料讓你欣賞美景的同時也可以享受美食營業時間平日11: 00－ 18: 00假日10: 00－ 18: 00下午茶14: 30－ 16: 30餐廳可預約訂位 037 - 823328若當日訂位已滿皆有開放現場候位全年無休， 除年節期間會另行公告有提供素食餐點 ",
// };

$(document).ready(function() {
    $.ajax({
        url: './gamedata.php',
        type: 'GET',
        dataType: 'JSON',
        success(data) {
            // console.log(data);
            var places = [];
            for (let key in data) {
                // console.log(key); //找key
                // console.log(data[key]);
                //找value
                places.push(data[key]);
            }
            places.sort(function() {
                return (0.5 - Math.random());
            });
            places.unshift(b0);
            console.log(places);
            // var imgB = new Image();
            // img.onload = function() { alert("img is loaded") };

            // var place = [b1, b2, b3, b4, b5, b6, b7, b8, b9, b10, b11, b12, b13, b14, b15, b16, b17, b18, b19];
            // place.sort(function() {
            //     return (0.5 - Math.random());
            // });
            // place.unshift(b0);

            //绑定棋格数据到棋格盒子上
            var boxes = [];
            // boxes.push(document.querySelector("#b" + '0' + ""))

            for (var i = 0; i < 20; i++) {
                boxes.push(document.querySelector("#b" + i + ""))
            }
            // console.log(boxes);
            //把数据中的名字写入棋格
            // boxes[0].firstElementChild.append(b0.name);

            for (var i = 0; i < 20; i++) {
                // boxes[i].firstElementChild.append(place[i].name);

                // let newImg = document.createElement("img");
                // newImg.src = place[i].src_img;
                // boxes[i].append(newImg);
                // boxes[i].firstElementChild.append(places[i].RES_NAME);
                $(`#b${i}`).append(
                    `
                    <h3>${places[i].RES_NAME}</h3>
                    <img src="./image/restaurant_management_img/${places[i].RES_IMAGE1}">
                    `
                )
            }
            //定义角色

        },
    });

});
var p1 = { name: "player1", index: 1, money: 15000, state: "", stop: 0, control: 1, }
var p2 = { name: "player2", index: 2, money: 15000, state: "", stop: 0, control: 1, }
var p3 = { name: "player3", index: 3, money: 15000, state: "", stop: 0, control: 1, }
var p4 = { name: "player4", index: 4, money: 15000, state: "", stop: 0, control: 1, }
var players = [p1, p2, p3, p4];




// var imgB = new Image();
// img.onload = function() { alert("img is loaded") };

// var place = [b1, b2, b3, b4, b5, b6, b7, b8, b9, b10, b11, b12, b13, b14, b15, b16, b17, b18, b19];
// place.sort(function() {
//     return (0.5 - Math.random());
// });
// place.unshift(b0);

// //绑定棋格数据到棋格盒子上
// var boxes = [];
// // boxes.push(document.querySelector("#b" + '0' + ""))

// for (var i = 0; i < 20; i++) {
//     boxes.push(document.querySelector("#b" + i + ""))
// }
// //把数据中的名字写入棋格
// // boxes[0].firstElementChild.append(b0.name);

// for (var i = 0; i < place.length; i++) {
//     boxes[i].firstElementChild.append(place[i].name);

//     let newImg = document.createElement("img");
//     newImg.src = place[i].src_img;
//     boxes[i].append(newImg);

// }
// //定义角色
// var p1 = { name: "player1", index: 1, money: 15000, state: "", stop: 0, control: 1, }
// var p2 = { name: "player2", index: 2, money: 15000, state: "", stop: 0, control: 1, }
// var p3 = { name: "player3", index: 3, money: 15000, state: "", stop: 0, control: 1, }
// var p4 = { name: "player4", index: 4, money: 15000, state: "", stop: 0, control: 1, }
// var players = [p1, p2, p3, p4];


// // window.addEventListener('load', doFirst);